---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.AreOrientationOptionsChanged
source: html/b5914526-ddbb-9633-e263-822ccee2a043.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.AreOrientationOptionsChanged Property

Indicates if the orientation options have changed since the last regeneration.

## Syntax (C#)
```csharp
public bool AreOrientationOptionsChanged { get; }
```